"""
config.py — 所有参数配置
"""

# ── 文件路径配置 ──────────────────────────────────────────────────────────────
DIR = r'E:\lzy\测试结果\2025.6.8 1TDC 125km 100Hz'


FILE_PAIRS = [
    {
        'signal': '3-24h_2025-06-08_174607.ttbin',
        'idler':  '1-24h-0.8nm_2025-06-08_174606.ttbin',
    },
    {
        'signal': '2-24h-0.8nm_2025-06-08_174607.ttbin',
        'idler':  '4-24h_2025-06-08_174607.ttbin',
    },
]

SAVE_FILE_PATH = DIR + r'\125km_py.csv'

# ── 互相关参数 ────────────────────────────────────────────────────────────
CORRELATION_WINDOW_PS = int(4e12)   # 4 s
CORRELATION_FRAMES    = int(4e7)    # bin 数

# ── 时间分片参数 ──────────────────────────────────────────────────────────
SPLIT_STEP_PS  = int(10e12)            # 每片 10 s
SPLIT_TIME_PS  = int(86400 * 1e12)    # 总时长 24 h

# ── 符合计数参数 ──────────────────────────────────────────────────────────
BIN_WIDTH_PS = 20
BIN_NUM      = 10_000

# ── 读取参数 ──────────────────────────────────────────────────────────────
READ_CHUNK_SIZE = 2_000_000   # 每次调用 FileReader.getData() 读取的最大条数
